from hub import Hub
from item import Item
import random
from datetime import datetime

def gen_obj(how_many, range_cost):
    "Создаем случайный объект со случайным именем, случайной стоимостью из заданного диапазона, случайной датой"
    for _ in range(how_many):
        new_cost = random.randint(range_cost[0], range_cost[1])
        str_letters = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'
        new_name = random.choices(str_letters, k=10)
        new_name = ''.join(new_name)
        new_dispatch_time = datetime(random.randint(1977, 2023), random.randint(1, 12), random.randint(1, 28))
        yield Item(name=new_name, cost=new_cost, dispatch_time=new_dispatch_time)

########################################################################################################################
# Теперь, пользуясь полученными классами заведите hub, отчистите его, и проведите несколько операций:
########################################################################################################################
new_hub = Hub(hub="Долгопрудный_склад", date=datetime(2000, 1, 12))
new_hub.clear()
# Добавьте в него несколько объектов
for i in gen_obj(100, (1, 100)):
    new_hub.add_item(i)

########################################################################################################################
# Выбросите все объекты с названиями начинающиеся на "a" или "A", записав их в отдельный лист A
########################################################################################################################
A = []
for i in range(len(new_hub)):  # составляем список из объектов, которые начинаются с буквы "A" или "а"
    current_obj = new_hub(i).info_Item()
    if ("a" in current_obj[1][0]) or ("A" in current_obj[1][0]):
        A.append(new_hub(i))
for i in range(len(A)):  # удаляем из Hub объекты из листа А
    new_hub.rm_item(A[i])
print('====================================================================================')
print('===============================Часть с объектами на А===============================')
print('====================================================================================')
print('*****************Объекты листа А*****************')
for elem in A:
    print(elem)


########################################################################################################################
# Выбросите все объекты с датой отправки раньше чем дата в hub, записав их в отдельный лист Outdated
########################################################################################################################
Outdated = new_hub.find_by_date(new_hub.date)
for i in range(len(Outdated)):  # удаляем из Hub объекты из листа Outdated
    new_hub.rm_item(Outdated[i])
print('====================================================================================')
print('===============================Часть с объектами Outdate============================')
print('====================================================================================')
print('*****************Объекты листа Outdated*****************')
for elem in Outdated:
    print(elem)


########################################################################################################################
# Выбросите топ-10 объектов из hub, записав их в MostValuable
########################################################################################################################
MostValuable = new_hub.find_most_valuable(10)
for i in range(len(MostValuable)):  # удаляем из Hub объекты из листа MostValuable
    new_hub.rm_item(MostValuable[i])
print('====================================================================================')
print('===============================Часть с объектами MostValuable============================')
print('====================================================================================')
print('*****************Объекты листа MostValuable*****************')
for elem in MostValuable:
    print(elem)


########################################################################################################################
# Оставшиеся на складе объекты запишите в Others
########################################################################################################################
Others = new_hub.info_Hub()[0]
print('====================================================================================')
print('===============================Часть с объектами Others============================')
print('====================================================================================')
print('*****************Объекты листа Others*****************')
for elem in Others:
    print(elem)